NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_tasks.c
#include "esp32s2_task.h"
#include "esp32s2_wifi.h"
#include "esp32s2_https_protocol.h"
#include "esp32s2_i2c_protocol.h"
#include "esp32s2_gpio.h"
#include "esp32s2_24lc512.h"
#include "esp32s2_socket.h"
#include "esp32s2_adc.h"
#include "esp32s2_algorithm.h"
#include "esp32s2_data_log.h"
#include "esp32s2_main.h"
#include "esp32s2_ina226.h"
#include "esp32s2_pac1952.h"
#include "esp32s2_buzzer.h"
#include "esp32s2_parse_data.h"
#include "esp32s2_button.h"
#include "freertos/event_groups.h"
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "esp_system.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_ota_ops.h"
#include "esp_http_client.h"
#include "esp_https_ota.h"
#include "esp32s2_fatal_err.h"
//#include "esp_clk.h"

#define TAG "esp32s2_tasks.c"
#define MAX_RETRY_FOR_TIMESYNC 15
#define MAX_RESTART_COUNT 3
#define DEVICE_RESTART_CNT_FILE "/spiffs/restart_count.txt" 

#define MAX_EEPROM_READ 5
extern uint8_t server_cert_pem_start[2048];
extern esp_err_t  client_event_handler(esp_http_client_event_t *evt);
extern uint8_t ap_ssid_buff[AP_SSID_LEN], ap_psw_buff[AP_PSW_LEN];
extern uint8_t connection_stat_check, config_calib_mode;
extern uint8_t packet_length;
extern char dev_id[12];

xSemaphoreHandle serverReset;
xSemaphoreHandle factoryReset;
xSemaphoreHandle otaSemaphore;
xSemaphoreHandle logdataSemaphore;
xSemaphoreHandle connectionSemaphore;
xSemaphoreHandle switchpressSemaphore;
xSemaphoreHandle switchpressConfirmedSemaphore;
xSemaphoreHandle serverSemaphore;
xSemaphoreHandle testConnectionSemaphore;
xSemaphoreHandle pacAlertSemaphore;
xSemaphoreHandle i2cSemaphore;
xSemaphoreHandle ledTaskSemaphore;
xSemaphoreHandle overVoltageProtectionSemaphore;
xSemaphoreHandle stateMachineSemaphore;
xSemaphoreHandle dataLoggingSemaphore;

TaskHandle_t serverTask_handle = NULL;
TaskHandle_t clientTask_handle = NULL;
TaskHandle_t normalTask_handle = NULL;
TaskHandle_t leastTask_handle  = NULL;

EventGroupHandle_t task_watchdog;


uint8_t https_request, https_action=0;
https_request_buffer_body_t https_request_buffer_body = {0,0,0,{0,0,0,0,0,0,0,0,0,0}};

uint8_t exit_server_task, access_point;
uint8_t algorithm_count=0,rtc_sync=0;
bool wifi_connection_status = 0;

uint8_t server_connect_retry=0,server_connect_retry_cnt=0;
uint8_t turt_state = TURT_STAT_ON, switch_state = 0, device_state=ALGO_ON,user_device_off=0;
uint8_t wait_time_sync=0;
uint8_t connection_stat_check=0,connection_stat=0,connection_stat_check_cnt=0;
uint16_t configuration_timeout_cnt;

operations_parameters_t critical_operations_parameters;
operations_parameters_t normal_operations_parameters;
operations_parameters_t least_priority_operations_parameters;

uint8_t fw_update=0,stop_lptask=0,perform_ota_task=0;

uint16_t watchdog_timer_count=0, watchdog_timer_reset=12000, watchdog_timer_stop=1;

uint8_t stopBatteryOverVoltageProtectionOnCalibration=0;

bool ledBlinkOn=false;

void set_rtc_sync_status(uint8_t status)
{
    rtc_sync = status;
}

uint8_t get_rtc_sync_status()
{
    return rtc_sync;
}

void createSemaphores(void){
  serverReset = xSemaphoreCreateBinary();
  factoryReset = xSemaphoreCreateBinary();
  otaSemaphore = xSemaphoreCreateBinary();
  logdataSemaphore = xSemaphoreCreateBinary();
  connectionSemaphore = xSemaphoreCreateBinary();
  switchpressSemaphore = xSemaphoreCreateBinary();
  switchpressConfirmedSemaphore = xSemaphoreCreateBinary();
  serverSemaphore = xSemaphoreCreateBinary();
  testConnectionSemaphore = xSemaphoreCreateBinary();
  pacAlertSemaphore = xSemaphoreCreateBinary();
  ledTaskSemaphore = xSemaphoreCreateBinary();
  overVoltageProtectionSemaphore = xSemaphoreCreateBinary();
  stateMachineSemaphore = xSemaphoreCreateBinary();
  dataLoggingSemaphore = xSemaphoreCreateBinary();
  i2cSemaphore = xSemaphoreCreateBinary();
  task_watchdog = xEventGroupCreate();
}

void test_wifi_config(void *param){
  while(true){
    if(xSemaphoreTake(testConnectionSemaphore, 10000 / portTICK_RATE_MS)){
        ESP_LOGI("CONFIGUARTION","Testing server connectivity");
      blink(led_green_color,ONE_SECOND_BLINK);
      deleteConfigCalibTask();
      vTaskDelay(1000/portTICK_PERIOD_MS);
      connection_stat_check=1;
      connectSTA( (char *) ap_ssid_buff , (char *) ap_psw_buff );
    }
  }
}

void mainTimerTask( void * param){
  static uint8_t ledTaskCount=0,overVoltageTaskCount=0,stateMachineTaskCount=0;
  static uint16_t dataLoggingTaskCount=0;
  TickType_t xLastWakeTime;
  const TickType_t xFrequency = 1;
  xLastWakeTime = xTaskGetTickCount();
  while(1){
    if(++ledTaskCount>10){
      ledTaskCount=0; 
      xSemaphoreGive(ledTaskSemaphore);
    }
    if(++overVoltageTaskCount>30){
      overVoltageTaskCount=0; 
      xSemaphoreGive(overVoltageProtectionSemaphore);
    }
    if(++stateMachineTaskCount>100){
      stateMachineTaskCount=0;
      xSemaphoreGive(stateMachineSemaphore); 
    }
    if(++dataLoggingTaskCount>1000){
      dataLoggingTaskCount=0; 
      xSemaphoreGive(dataLoggingSemaphore);
    }        
    vTaskDelayUntil( &xLastWakeTime, xFrequency );
  }
}

void overvoltageProtectionTask( void * param){
    while(1){
      xSemaphoreTake(overVoltageProtectionSemaphore,portMAX_DELAY);
      if(!test_error((ERR_NOT_CALIB | ERR_NOT_CONFIG))){
        if(ledBlinkOn){
          if(stopBatteryOverVoltageProtectionOnCalibration==0){
            check_battery_voltage(); 
          }
        }
      }
      xEventGroupSetBits(task_watchdog,overvoltageProtectionTaskEvent);
    }
}

void ledBlinkTask( void * param){
    while(1){
      xSemaphoreTake(ledTaskSemaphore,portMAX_DELAY);
      if(ledBlinkOn){
        led_blink();
      }
    }
}

void stateMachineTask( void * param){
    static uint8_t seconds_cnt = 0;
    static uint8_t minutes_cnt = 0;
    static uint8_t hour_cnt = 0;
    static uint16_t day_cnt = 0;
    static uint32_t year_cnt = 0;

    while(1){
      xSemaphoreTake(stateMachineSemaphore,portMAX_DELAY);

      if(test_common_flag(CF_RESET_DEV)){
        clear_common_flag(CF_CLR_ALL);
        xSemaphoreGive(serverReset);
      }
 
      server_connect_retry_cnt+=1;
 
