NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_tasks.c
      if(xPortGetFreeHeapSize() < 10240) {
          ESP_LOGI(TAG,"Heap value %d",xPortGetFreeHeapSize());
      }
      if(if_algo_stopped() == 0){
        if(!test_error((ERR_NOT_CALIB | ERR_NOT_CONFIG))){
          ESP_LOGI(TAG,"iCON LV 8.00 algorithm");
          turtle_algorithm();
          watchdog_timer_count=0;
        }
        else{
          watchdog_timer_count=0;
          if(test_error(ERR_NOT_CALIB)){
            ESP_LOGI(TAG,"Device not calibrated");
          }

          if(test_error(ERR_NOT_CONFIG)){
            ESP_LOGI(TAG,"Device not configured");
          }
        }
      }
#if ICUBE == 0
      #warning "Inverter failure buzzer enabled"
      if(test_system_flag(SF_INV_FAIL)){ toggle_buzzer(); };
#endif 
      xEventGroupSetBits(task_watchdog,stateMachineTaskEvent);
      seconds_cnt++;
      if(seconds_cnt == 60) {
          minutes_cnt++;
          seconds_cnt = 0;
      }
      if(minutes_cnt == 60) {
          hour_cnt++;
          minutes_cnt = 0;
      }
      if(hour_cnt == 24) {
          day_cnt++;
          hour_cnt = 0;
      }
      if(day_cnt == 365) {
          year_cnt++;
          day_cnt = 0;
      }
      if( (minutes_cnt == 30) && (seconds_cnt == 0) ) {
          ESP_LOGI("UP TIME", "%d Year %d Days %d Hour %d Minutes %d Seconds",
                  year_cnt,day_cnt,hour_cnt,minutes_cnt,seconds_cnt);
      }
    }
}

void OnConnected(void *para){
  while(true){
    if(xSemaphoreTake(logdataSemaphore, 10000 / portTICK_RATE_MS)){
        vTaskDelay(10/portTICK_RATE_MS);
      if(connection_stat_check){
        test_server_connection();
      }
      else{
        if(https_action==1){
          bidirectional_communication_commands(&https_request_buffer_body);
        }
        else{
          send_DATA_to_server();
        }
      }
      ESP_LOGI("inside on connected", "Done!");
    }
  }
}

void dataLoggingTask( void * param){
  while(1){
    xSemaphoreTake(dataLoggingSemaphore,portMAX_DELAY);
    xEventGroupSetBits(task_watchdog,dataLoggingTaskEvent);

    if(watchdog_timer_stop==0){
      ESP_LOGI(TAG,"Checking watchdogTimer");
      if(++watchdog_timer_count>2){
        ESP_LOGI(TAG,"Watchdog Timer Expired");
        switch_state_4_5();
        ESP_LOGI(TAG,"Restarting the system");
        fatal_err_handler(WATCHDOG,WD_EXPIRED);
      }
    }

    static uint8_t getInfoTime=0;
    if(++getInfoTime>30){
      getInfoTime=0;
      https_req_buff_write(&https_request_buffer_body,get_information);
    }

    if((if_algo_stopped() == 0)&&(stop_lptask==0)){
      ESP_LOGI(TAG,"10 second tick");
      if(!test_error((ERR_NOT_CALIB | ERR_NOT_CONFIG))){
        least_priority_operations();
      }
    }

    if(connection_stat_check){
      if(++connection_stat_check_cnt>6){
        connection_stat_check=0;
        set_algo_status(0);
        watchdog_timer_stop=0;
      }
    }

    if(if_algo_stopped() == 1) {
      if(++configuration_timeout_cnt>=30){
          ESP_LOGI("ALERT","CONFIGURATION TIMEOUT EXCEEDED, STOPPING THE CONFIGURATION MODE");
          configuration_timeout_cnt=0;
          set_algo_status(0);
          watchdog_timer_stop=0;
          deleteConfigCalibTask();
      }
    }
  }
}

void TrySyncTime(void){
  if(get_rtc_sync_status() == 0) {
    ESP_LOGI(TAG,"Trying to sync time");
    least_priority_operations_parameters.status=waiting_for_time_synced;
    esp_wifi_stop();
    if(access_point==primary){
      ESP_LOGI(TAG,"Connecting to primary access point");
      connectSTA((char *)ap_ssid_buff,(char *)ap_psw_buff);
    }
    else{
      ESP_LOGI(TAG,"Connecting to secondary access point");
      connectSTA("E24by7","Energy24by7");
    }
  } else {
    wait_time_sync=0;
    least_priority_operations_parameters.status=lpos_data_not_available;    
  }
}

void TimeoutSyncTime(void){
  if(get_rtc_sync_status() == 0 ){
    ESP_LOGI(TAG,"Waiting to sync time");
    if(++wait_time_sync > 2){
      wait_time_sync=0;
      least_priority_operations_parameters.status = time_not_synced;
      if(access_point==primary){
        access_point=secondary;
      }
      else{
        access_point=primary;
      }
      ESP_LOGI(TAG,"Couldn't sync time");
    }
  } else {
    wait_time_sync=0;
    least_priority_operations_parameters.status=lpos_data_not_available;
  }  
}

void checkDataAvailable(void){
    uint16_t log_available = 0;
    if(fw_update) {
        ESP_LOGI(TAG,"OTA update");
        fw_update=0;
        perform_ota_task=1;
        least_priority_operations_parameters.status=lpos_data_available;      
    } else {
        log_available = turtle_log_available();
        //if(log_available > packet_length){
        if(log_available > 10) { // Temp fix to not sending log request.
            ESP_LOGI(TAG,"Data available in EEPROM of %d numbers",log_available);
            least_priority_operations_parameters.status=lpos_data_available;
        } else {
            if(https_req_buff_available(&https_request_buffer_body)!=0){
                ESP_LOGI(TAG,"Request is %d",https_req_buff_peek(&https_request_buffer_body));
                https_action=1;
                least_priority_operations_parameters.status=lpos_data_available;
            } else{
                ESP_LOGI(TAG,"No operation to perform");
            }
        }    
    }
}

void connectingToAP(void){
  if(wifi_connection_status){
    ESP_LOGI(TAG,"Already connected to AP");
    least_priority_operations_parameters.status=lpos_link_connected;
  }
  else{
    ESP_LOGI(TAG,"Not connected to AP");
    least_priority_operations_parameters.status=lpos_link_not_connected;
  }
}

void trySwitchingAP(void){
  if(access_point==primary){
    ESP_LOGI(TAG,"Connecting to primary access point");
    connectSTA((char *)ap_ssid_buff,(char *)ap_psw_buff);
  }
  else{
    ESP_LOGI(TAG,"Connecting to secondary access point");
    connectSTA("E24by7","Energy24by7");
  }
  least_priority_operations_parameters.status=lpos_link_connected;
  least_priority_operations_parameters.wait_time = 0;
}

void waitConnectingToAP(void){
  if(wifi_connection_status==0){
    if(++least_priority_operations_parameters.wait_time>1){
      esp_wifi_stop();
      if(access_point==primary){
        access_point=secondary;
      }else{
        access_point=primary;
      }
      least_priority_operations_parameters.wait_time=0;
      least_priority_operations_parameters.status=lpos_link_not_connected;
    }
    else{
      if(access_point==primary){
        ESP_LOGI(TAG,"Wait to connect with primary access point");
      }
      else{
        ESP_LOGI(TAG,"Wait to connect with secondary access point");
      }
    }
  }
  else{
    if(access_point==primary){
      ESP_LOGI(TAG,"Connected to primary access point");
    }
    else{
      ESP_LOGI(TAG,"Connected to secondary access point");
    }
    if(perform_ota_task){
      stop_lptask=1;
      perform_ota_task = 0;
      fw_update=0;
      xSemaphoreGive(otaSemaphore);
    }
    else{
      xSemaphoreGive(logdataSemaphore);
    }
    least_priority_operations_parameters.wait_time=0;
    least_priority_operations_parameters.status=lpos_waiting_for_response;
  }  
}

void waitingForServerResponse(void){
  if(++least_priority_operations_parameters.wait_time > 12){
    least_priority_operations_parameters.status=lpos_communication_failed;
    least_priority_operations_parameters.wait_time=0;
    ESP_LOGI(TAG,"Data logging failed");
  }
  else{
    ESP_LOGI(TAG,"Waiting for response from server");
  }
}

void onResponseFromServer(void){
    ESP_LOGI(TAG,"Received response from server");
    least_priority_operations_parameters.wait_time=0;
    if(https_action==1){
        https_req_buff_flush(&https_request_buffer_body);
        https_action=0;
    } else {
        if(get_server_resp_status() == 1) {
            ESP_LOGI(TAG,"EEPROM tail updated");
            turtle_log_update_tail();
        } else {
            ESP_LOGI(TAG,"Server response is not OK.. EEPROM tail not updating");
        }
    }
    least_priority_operations_parameters.status=lpos_data_not_available;
    esp_wifi_stop();  //VINEETH
}

void onCommunicationFailed(void){
  least_priority_operations_parameters.status=lpos_data_not_available;
  esp_wifi_stop(); //VINEETH
}

static inline int get_restart_count()
{
    int restart_cnt = 0;
    FILE* fp = fopen(DEVICE_RESTART_CNT_FILE, "r");
    if(fp == NULL) {
        return 0; // Return device reset count as 0
    } else {
        fseek(fp, 0, SEEK_SET);
        fread(&restart_cnt, 1, sizeof(int), fp);
        fclose(fp);
    }
    return restart_cnt;
}

