NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_tasks.c
static inline int update_restart_count(int restart_cnt)
{
    int ret = -1;
    FILE* fp = fopen(DEVICE_RESTART_CNT_FILE, "w+");
    if(fp != NULL) {
        if( fwrite(&restart_cnt, 1, sizeof(int), fp) == sizeof(int)) {
            ESP_LOGI(TAG, "Writing value [%d] to [%s] SUCCESS",restart_cnt,DEVICE_RESTART_CNT_FILE);
            ret = 0;
        } else {
            ESP_LOGI(TAG, "Writing value [%d] to [%s] FAILS",restart_cnt,DEVICE_RESTART_CNT_FILE);
            ret = -1;
        }
        fclose(fp);
    } else {
        ESP_LOGI(TAG,"File [%s] open fails",DEVICE_RESTART_CNT_FILE);
        ret = -1;
    }
    return ret;
}


void least_priority_operations(void){
    static int timesync_failed_count = 0;
    int restart_cnt = 0;
    int readback_val = 0;
    static int timesync_updated = 0;
    switch(least_priority_operations_parameters.status){
        case time_not_synced:
            ESP_LOGI("LPOS","lpos_time_not_synced");
            /* 
             * Time get synced once device gets Wi-Fi connection,
             * Obtain ip, sync time with NTP. If device is in
             * time_not_synced means, there could be following 
             * reasons for it.
             * 1) Device do not connect to Wi-Fi
             * 2) Obtaining IP fails
             * 3) Internet is not available
             * 4) NTP is not accessible
             * If device is not able to time sync, after a certain
             * no of retries, restart the device. This total no
             * of retries can be limited to a max value for the
             * life time of the device.
             */
            TrySyncTime();
            timesync_failed_count++;
            if(timesync_failed_count >= MAX_RETRY_FOR_TIMESYNC) {
                ESP_LOGI("LPOS_TIME_SYNC_ERR","Maximum retry for timesync reached");
                timesync_failed_count = 0;
                /* Check the maximum restart reached */
                restart_cnt = get_restart_count();
                if(restart_cnt < MAX_RESTART_COUNT) {
                    ESP_LOGI("LPOS_TIME_SYNC_ERR","Device restart count: %d",restart_cnt);
                    /* Update restart count before restarting */
                    if (update_restart_count(restart_cnt+1) == 0) { // Updation success
                        // Double check to ensure that value is written properly
                        readback_val = get_restart_count();
                        if(readback_val == (restart_cnt+1)) {
                            vTaskDelay(1000/portTICK_PERIOD_MS);
                            ESP_LOGI("LPOS_TIME_SYNC_ERR",
                                    "Restarting the device as time sync fails");
                            fatal_err_handler(TIME_SYNC,TIME_SYNC_FAILS);
                        }
                    }
                } else {
                    ESP_LOGI("LPOS_TIME_SYNC_ERR",
                            "Device restart count: %d reached max restart count",restart_cnt);
                }
            }

            break;
        case waiting_for_time_synced:
            ESP_LOGI("LPOS","lpos_waiting_for_time_synced");
            TimeoutSyncTime();
            break;
        case lpos_data_not_available:
            ESP_LOGI("LPOS","lpos_data_not_available" );
            /* 
             * Once timesync is success, then restart feature
             * should not happen so set as maximum restart 
             * happened (faking)
             */
            if(timesync_updated == 0) {
                update_restart_count(MAX_RESTART_COUNT);
                // Double check to ensure that value is written properly
                readback_val = get_restart_count();
                if(readback_val >= MAX_RESTART_COUNT) {
                    timesync_updated = 1;
                    ESP_LOGI("LPOS","Succesfully updated as maximum restart count reached");
                } else {
                    ESP_LOGI("LPOS","Failed to update as maximum restart count reached");
                    timesync_updated = 0;
                }
            }
            checkDataAvailable();
            break;
        case lpos_data_available:
            ESP_LOGI("LPOS","lpos_data_available" );
            connectingToAP();
            break;
        case lpos_link_not_connected:
            ESP_LOGI("LPOS","lpos_link_not_connected" );
            trySwitchingAP();
            break;
        case lpos_link_connected:
            ESP_LOGI("LPOS","lpos_link_connected" );
            waitConnectingToAP();
            break;
        case lpos_waiting_for_response:
            ESP_LOGI("LPOS","lpos_waiting_for_response" );
            waitingForServerResponse();
            break;
        case lpos_response_received:
            ESP_LOGI("LPOS","lpos_response_received" );
            onResponseFromServer();
            break;
        case lpos_communication_failed:
            ESP_LOGI("LPOS","lpos_communication_failed" );
            onCommunicationFailed();
            break;
    }
}

static esp_err_t validate_image_header(esp_app_desc_t *new_app_info)
{
    if (new_app_info == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    const esp_partition_t *running = esp_ota_get_running_partition();
    esp_app_desc_t running_app_info;
    if (esp_ota_get_partition_description(running, &running_app_info) == ESP_OK) {
        ESP_LOGI(TAG, "Running firmware version: %s", running_app_info.version);
    }
     return ESP_OK;
}


static esp_err_t _http_client_init_cb(esp_http_client_handle_t http_client)
{
    esp_err_t err = ESP_OK;
    /* Uncomment to add custom headers to HTTP request */
    // err = esp_http_client_set_header(http_client, "Custom-Header", "Value");
    return err;
}

void perform_ota(void *params){
  extern uint8_t https_password[SERV_IP_LEN];
  esp_err_t ota_finish_err = ESP_OK;
  while (true){
    char url[2048];
    read_domain(url);
    strcat(url,"/api/getOta/");
    xSemaphoreTake(otaSemaphore, portMAX_DELAY);
    ESP_LOGI(TAG, "Invoking OTA");
    ESP_LOGI(TAG, "\n[%ld], OTA: URL: %s \n",time(NULL),url);
    esp_http_client_config_t clientConfig = {
      .url = url,
      .event_handler = client_event_handler,
      .cert_pem = (char *)server_cert_pem_start,
      .username = (char *)dev_id,
      .password = (char *) https_password,
      .auth_type = HTTP_AUTH_TYPE_BASIC,
      .timeout_ms = 60000,
      .keep_alive_enable = true,
    };

    esp_https_ota_config_t ota_config = {
        .http_config = &clientConfig,
        .http_client_init_cb = _http_client_init_cb, // Register a callback to be invoked after esp_http_client is initialized
    };

    esp_https_ota_handle_t https_ota_handle = NULL;
    esp_err_t err = esp_https_ota_begin(&ota_config, &https_ota_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "\n [%ld] OTA: ESP HTTPS OTA Begin failed: %s\n",time(NULL), esp_err_to_name(err));
        goto ota_end;
    }

