NyQuest-Innovation/icon_lv_8/Source/icon-lv-8/components/esp32s2_tasks.c
    esp_app_desc_t app_desc;
    err = esp_https_ota_get_img_desc(https_ota_handle, &app_desc);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "\n [%ld] OTA: esp_https_ota_read_img_desc failed: %s\n",time(NULL),esp_err_to_name(err));
        goto ota_end;
    }
    err = validate_image_header(&app_desc);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "\n [%ld] OTA: image header verification failed: %s\n",time(NULL),esp_err_to_name(err));
        goto ota_end;
    }

    while (1) {
        err = esp_https_ota_perform(https_ota_handle);
        if (err != ESP_ERR_HTTPS_OTA_IN_PROGRESS) {
            ESP_LOGI(TAG, "\n [%ld] OTA: esp_https_ota_perform: %s\n",time(NULL),esp_err_to_name(err));
            break;
        }
        // esp_https_ota_perform returns after every read operation which gives user the ability to
        // monitor the status of OTA upgrade by calling esp_https_ota_get_image_len_read, which gives length of image
        // data read so far.
        ESP_LOGD(TAG, "OTA: Image bytes read: %d", esp_https_ota_get_image_len_read(https_ota_handle));
    }

    if (esp_https_ota_is_complete_data_received(https_ota_handle) != true) {
        // the OTA image was not completely received and user can customise the response to this situation.
        ESP_LOGE(TAG, "[%ld] OTA: Complete data was not received.",time(NULL));
        goto ota_end;
    } else {
        ota_finish_err = esp_https_ota_finish(https_ota_handle);
        if ((err == ESP_OK) && (ota_finish_err == ESP_OK)) {
            ESP_LOGI(TAG, "[%ld] OTA: ESP_HTTPS_OTA upgrade successful. Rebooting ...",time(NULL));
            set_algo_status(1);
            watchdog_timer_stop=1;
            vTaskDelay(pdMS_TO_TICKS(1000));
            switch_state_4_5();
            //esp_clk_slowclk_cal_set(0); // HACK TO SOLVE RTC TIME JUMP ISSUE
            fatal_err_handler(OTA_UPDATE,OTA_UPDATE_DONE);
        } else {
            if (ota_finish_err == ESP_ERR_OTA_VALIDATE_FAILED) {
                ESP_LOGE(TAG, "[%ld] OTA: Image validation failed, image is corrupted\n",time(NULL));
            }
            ESP_LOGE(TAG, "[%ld] OTA: ESP_HTTPS_OTA upgrade failed 0x%x [%s]", time(NULL),
                        ota_finish_err,esp_err_to_name(ota_finish_err));
            goto ota_end;
        }
    }
    ota_end:
    esp_https_ota_abort(https_ota_handle);
    ESP_LOGE(TAG, "[%ld] OTA: ESP_HTTPS_OTA upgrade failed",time(NULL));
    stop_lptask = 0;
    fw_update = 1;
  }  
}

void perform_factory_reset(void *params){
  while(1){
    xSemaphoreTake(factoryReset, portMAX_DELAY);
    extern void fcn_factory_reset(void);
    fcn_factory_reset();
  }
}

void perform_system_reset(void *params){
  while(1){
    xSemaphoreTake(serverReset,portMAX_DELAY);
    i2c_eeprom_write_buff(0xFE7F,(uint8_t *) &common_flag,2);
    printf("restarting in 5 seconds\n");
    set_algo_status(1);
    watchdog_timer_stop=1;
    vTaskDelay(pdMS_TO_TICKS(5000));
    switch_state_4_5();
    fatal_err_handler(SERVER_RESET,RST_SERVER_RESET);
  }
}

void watchdogTask(void){
  while(1){

    if(watchdog_timer_stop==0){
      uint32_t result = xEventGroupWaitBits(task_watchdog, allEvents, pdTRUE, pdTRUE, 10000/portTICK_RATE_MS);
      if((result&allEvents)==allEvents){
        ESP_LOGI("Inside watchdogTask","System healthy");
      }
      else{

        ESP_LOGI(TAG,"Watchdog Timer Expired");
        switch_state_4_5();

        if(!(result&overvoltageProtectionTaskEvent)){
          ESP_LOGI("Inside watchdogTask","overvoltage protection task not responding");
        }

        if(!(result&stateMachineTaskEvent)){
          ESP_LOGI("Inside watchdogTask","state machine task not responding");
        }

        if(!(result&dataLoggingTaskEvent)){
          ESP_LOGI("Inside watchdogTask","data logging task not responding");
        }
        fatal_err_handler(WATCHDOG,WD_EXPIRED);
      }
    }
    vTaskDelay(1000/portTICK_RATE_MS);
  }
}

void createTasks(void){
  xTaskCreate(&buttonPressDetection_routine,"Button press",4096,NULL,5,NULL);
  xTaskCreate(&buttonPressTask,"Button press confirmed",4096,NULL,5,NULL);
  xTaskCreate(&dataLoggingTask,"dataLogging",4096,NULL,1,NULL);
  xTaskCreate(&ledBlinkTask,"ledBlink",1024,NULL,3,NULL);
  xTaskCreate(&overvoltageProtectionTask,"overvoltageProtection",4096,NULL,4,NULL);
  xTaskCreate(&stateMachineTask,"stateMachineAlgorithm",4096,NULL,2,NULL);
  xSemaphoreGive(i2cSemaphore);
  xTaskCreate(&mainTimerTask,"mainTimer",1024,NULL,5,NULL);

  if(test_error(ERR_NO_MEMORY)){
    ESP_LOGI(TAG,"EEPROM not detected");
    blink(led_red_color,LED_OFF);
  }
  else{
    least_priority_operations_parameters.status=time_not_synced;
    https_req_buff_write(&https_request_buffer_body,update_configuration);
    watchdog_timer_stop=0;
    xTaskCreate(&OnConnected, "data logging", 5*4096, NULL, 5, NULL);
    xTaskCreate(&test_wifi_config,"Test configuration",4096,NULL,5,NULL);
    xTaskCreate(&perform_ota, "perform_ota", 1024 * 8, NULL, 2, NULL);
    xTaskCreate(&perform_factory_reset, "perform_fac_reset", 4096, NULL, 2, NULL);
    xTaskCreate(&perform_system_reset, "perform_system_reset", 4096 , NULL, 2, NULL);
  }
}
